---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFC.SetFile(Autodesk.Revit.DB.IFC.IFCFile)
source: html/30eb507b-8796-ce4e-ec59-1684e1306a0f.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.SetFile Method

Sets the handle to the IFC file being created during this export operation.

## Syntax (C#)
```csharp
public void SetFile(
	IFCFile file
)
```

## Parameters
- **file** (`Autodesk.Revit.DB.IFC.IFCFile`) - The handle to the file.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null